---
kind: property
id: P:Autodesk.Revit.DB.Analysis.MEPAnalyticalNode.IsFlowBlocked
source: html/d54debcb-00d7-629f-5cda-e91dc8e18232.htm
---
# Autodesk.Revit.DB.Analysis.MEPAnalyticalNode.IsFlowBlocked Property

Is the flow blocked at this analytical node?

## Syntax (C#)
```csharp
public bool IsFlowBlocked { get; }
```